/*
 *	Script.cpp 
 *  Стартовый модуль консольного приложения.
 *  Пример реализации интерпретатора подмножества BASIC-образного
 *  языка программирования, разработанный в качестве примера 
 *  лабораторной работы к курсу ЛО САПР.
 */ 

#include "stdafx.h"
#include <fstream>
#include "executor.h"

//чем отличаются _tmain от обычного 
int _tmain(int argc, _TCHAR* argv[])
{

    //Если на вход программы поступило меньше 2х аргументов, то выкидываем ошибку
  if (argc < 2) {
    std::cout << "Usage: " << std::endl;
    std::cout << "Script filename.ext" << std::endl;
    return 1;
  }
  //Попытка открыть файл по пути, во втором аргументе
  try {
    std::ifstream in(argv[1]);
    if (!in)
      throw "Can't open file";
    execute_script(in);//если всё ок,  то продолжаем работу
  }
  //выкидываем исключение и предупреждение, что у нас ошибка типа s
  catch (const char *s) {
    std::cerr << std::endl << "ERROR: " << s << std::endl;
  }

  return 0;
  /*Понятие нуля исторически появилось как особый цифровой символ, необходимый при записи чисел в позиционной системе счисления. 
  Этот символ указывал на отсутствие значения в соответствующем разряде, что позволяло не путать, например, записи 4,40,400.
  Придание нулю статуса полноценного числа происходит постепенно в начале Нового времени.*/
}

/*Общие наблюдения:
    -везде используется float, хотя, можно было и double
    -Почему-то студия жаловалась на отсутствие библиотек типа map, iostream... 
        Мы последовали действиям, предложенным Visual Studio (добавили библиотеки в заголовочные файлы)
        Предупреждения исчезли
    -Хотя, всё равно очень много предупреждений
*/

